class ConfigHerbivore:
    """
    Вспомогательный класс для тонкой настройки травоядных

    P.s. т.к. в данном проекте не используются фреймворки, 
    чтобы не передавать массу аргументов при создании травоядных
    было принято решение создать для этого отдельный класс
    """
    pass

class ConfigPredator:
    """
    Вспомогательный класс для тонкой настройки травоядных

    P.s. т.к. в данном проекте не используются фреймворки, 
    чтобы не передавать массу аргументов при создании травоядных
    было принято решение создать для этого отдельный класс
    """
    pass
